//-----------------------------------------------------------------------------------------------------------------------------------------------------------
//2023.2학기 c++ 11.22 (12주 1일)
// 
//-----------------------------------------------------------------------------------------------------------------------------------------------------------
// 사용자 정의 자료형 - 파일에 쓰고 읽기
// ----------------------------------------------------------------------------------------------------------------------------------------------------------
// 과제 - 나만의 자료형을 만들어 반복연습
//-----------------------------------------------------------------------------------------------------------------------------------------------------------

#include<iostream>
#include<fstream>
#include<string>
#include "save.h"
#include"STRING.h"
using namespace std;

//***시험
//[문제] "개20마리.txt" 파일에 class Dog 객체 20개의 정보를 
// 연산자 <<를 사용하여 기록하였다.
//읽어서 나이 오름차순으로 정렬한 후 화면에 출력하라.
//클래스가 어떤 멤버를 갖고 있는지 정보를 알아야 이 문제를 풀 수 있다.

//class Dog {
//	int age;
//	string name;
//	
//	friend ostream& operator<<(ostream& os, const Dog& d) {
//		os << dog.age << '\t' << dog.name << '\t';
//		return os;
//	}
//};
//이 정보를 갖고 문제 해결

class Dog {
	int age;
	string name;

public:
	friend istream& operator>>(istream& is, Dog& d) {
		is >> d.age >> d.name;
		return is;
	}

	friend ostream& operator<<(ostream& os, const Dog& d) {//파일 저장을 할게 아니라서 나이: 이런식으로 출력해도 된다.
		os << "나이 : "<<d.age << '\t' << "이름 : " << d.name << '\t';
		return os;
	}
};

//---------
int main()
//---------
{
	Dog dog;
	ifstream in{ "개20마리.txt" };

	if (not in) {
		cout << "파일 읽기 실패" << endl;
		return 0;
	}

	in >> dog;

	cout << dog;

	save("소스.cpp");
}

